# Allows to install updates automatically.
tap 'homebrew/autoupdate'

# Remove formula and its dependencies with 'brew rmrec <formula>'.
tap 'ggpeti/rmrec'

# GNU utilities.
brew 'binutils'
brew 'coreutils'
brew 'diffutils'
brew 'dos2unix'
brew 'file-formula'
brew 'findutils'
brew 'gawk'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'gpatch'
brew 'grep'
brew 'gzip'
brew 'make'
brew 'pidof'
brew 'rsync'
brew 'tree'
brew 'unzip'
brew 'watch'

# QuickLook plugins, https://github.com/sindresorhus/quick-look-plugins
cask 'betterzip'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'quicklookase'
cask 'suspicious-package'
cask 'webpquicklook'

# FUSE.
tap 'gromgit/homebrew-fuse'
cask 'macfuse'
brew 'sshfs-mac'

# Apps without topic directories.
brew 'bitwarden-cli'
brew 'curl'
brew 'httpie'
brew 'jid'
brew 'm-cli'
brew 'ncdu'
brew 'nmap'
brew 'p7zip'
brew 'shellcheck'
brew 'wakeonlan'

cask 'anydesk'
cask 'authy'
cask 'keeweb'
cask 'slack'
cask 'microsoft-office'
cask 'microsoft-teams'
cask 'libreoffice' 
cask 'spotify'

cask 'cleanmymac'
cask 'dash'
cask 'dockmate'
cask 'dotnet-sdk'
cask 'double-commander'

cask 'dropbox'
cask 'google-drive'
cask 'google-chrome'
cask 'java'
cask 'jetbrains-toolbox'
cask 'visual-studio-code'
cask 'kap'
cask 'key-codes'
cask 'macdown'
cask 'paste'
cask 'postman'
cask 'skype'
cask 'symboliclinker'
cask 'teamviewer'
# vim: set ft=ruby ts=2 sw=2 et:
